modules/zuora/test/fixtures/subWithDiscount.json

{
	"success": true,
	"id": "71a1836bbe69b2f6951b31a110c30aea",
	"accountId": "8ad0855896cc19170196ce3ee9db7d45",
	"accountNumber": "A01002706",
	"accountName": "001UD00000EU61XYAT",
	"invoiceOwnerAccountId": "8ad0855896cc19170196ce3ee9db7d45",
	"invoiceOwnerAccountNumber": "A01002706",
	"invoiceOwnerAccountName": "001UD00000EU61XYAT",
	"subscriptionNumber": "A-S00985326",
	"version": 3,
	"revision": "3.0",
	"termType": "TERMED",
	"invoiceSeparately": false,
	"contractEffectiveDate": "2025-05-14",
	"serviceActivationDate": "2025-05-14",
	"customerAcceptanceDate": "2025-05-14",
	"subscriptionStartDate": "2025-05-14",
	"subscriptionEndDate": "2026-05-14",
	"lastBookingDate": "2025-12-18",
	"termStartDate": "2025-05-14",
	"termEndDate": "2026-05-14",
	"initialTerm": 12,
	"initialTermPeriodType": "Month",
	"currentTerm": 12,
	"currentTermPeriodType": "Month",
	"autoRenew": true,
	"renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
	"renewalTerm": 12,
	"renewalTermPeriodType": "Month",
	"currency": "GBP",
	"contractedMrr": 12.0,
	"totalContractedValue": 144.0,
	"notes": null,
	"status": "Active",
	"TrialPeriodPrice__c": null,
	"CanadaHandDelivery__c": null,
	"AcquisitionMetadata__c": null,
	"QuoteNumber__QT": null,
	"GifteeIdentityId__c": null,
	"OpportunityName__QT": null,
	"LastQSSPaymentDate__c": null,
	"GiftNotificationEmailDate__c": null,
	"Gift_Subscription__c": "No",
	"TrialPeriodDays__c": null,
	"CreatedRequestId__c": "83ee501d-412c-51f2-0000-0000000003c5",
	"ActivationDate3__c": null,
	"AcquisitionSource__c": null,
	"CreatedByCSR__c": null,
	"CASSubscriberID__c": null,
	"LastPriceChangeDate__c": null,
	"InitialPromotionCode__c": null,
	"Suspended__c": "false",
	"CpqBundleJsonId__QT": null,
	"RedemptionCode__c": null,
	"QuoteType__QT": null,
	"GiftRedemptionDate__c": null,
	"QuoteBusinessType__QT": null,
	"SupplierCode__c": null,
	"legacy_cat__c": null,
	"DeliveryAgent__c": null,
	"AcquisitionCase__c": null,
	"ReaderType__c": "Direct",
	"ActivationDate__c": null,
	"UserCancellationReason__c": null,
	"SuspensionStatus__c": "Active",
	"CardCountry__c": null,
	"OpportunityCloseDate__QT": null,
	"IPaddress__c": null,
	"IPCountry__c": null,
	"CancelledBy__c": null,
	"LastPlanAddedDate__c": null,
	"dummy__c": null,
	"PromotionCode__c": null,
	"OriginalSubscriptionStartDate__c": null,
	"LegacyContractStartDate__c": null,
	"CancellationReason__c": null,
	"billToContact": {
		"id": "8ad0855896cc19170196ce3eea0d7d63",
		"address1": null,
		"address2": null,
		"city": null,
		"country": "United Kingdom",
		"county": null,
		"fax": null,
		"state": null,
		"postalCode": null,
		"firstName": "123asdfpoiu098",
		"lastName": "123asdfpoiu098",
		"nickname": null,
		"workEmail": "test.user+123asdfpoiu098@guardian.co.uk",
		"personalEmail": null,
		"homePhone": null,
		"mobilePhone": null,
		"otherPhone": null,
		"otherPhoneType": null,
		"taxRegion": null,
		"workPhone": null,
		"contactDescription": null,
		"Company_Name__c": null,
		"SpecialDeliveryInstructions__c": null,
		"Title__c": null,
		"zipCode": null,
		"accountId": "8ad0855896cc19170196ce3ee9db7d45",
		"accountNumber": "A01002706",
		"isSpecifiedInSubscription": false
	},
	"paymentTerm": null,
	"invoiceTemplateId": null,
	"invoiceTemplateName": null,
	"sequenceSetId": null,
	"sequenceSetName": null,
	"soldToContact": {
		"id": "8ad0855896cc19170196ce3eea0d7d63",
		"address1": null,
		"address2": null,
		"city": null,
		"country": "United Kingdom",
		"county": null,
		"fax": null,
		"state": null,
		"postalCode": null,
		"firstName": "123asdfpoiu098",
		"lastName": "123asdfpoiu098",
		"nickname": null,
		"workEmail": "test.user+123asdfpoiu098@guardian.co.uk",
		"personalEmail": null,
		"homePhone": null,
		"mobilePhone": null,
		"otherPhone": null,
		"otherPhoneType": null,
		"taxRegion": null,
		"workPhone": null,
		"contactDescription": null,
		"Company_Name__c": null,
		"SpecialDeliveryInstructions__c": null,
		"Title__c": null,
		"zipCode": null,
		"accountId": "8ad0855896cc19170196ce3ee9db7d45",
		"accountNumber": "A01002706",
		"isSpecifiedInSubscription": false
	},
	"isLatestVersion": true,
	"cancelReason": null,
	"ratePlans": [
		{
			"id": "71a1836bbe69b2f6951b31a110570ae3",
			"lastChangeType": "Add",
			"productId": "2c92c0f85721ff7c01572940171363db",
			"productName": "Discounts",
			"productSku": "SKU-00000044",
			"productRatePlanId": "8ad081dd8fd3d9df018fe2b6a7bc379d",
			"productRatePlanNumber": "PRP-00000242",
			"ratePlanName": "Cancellation Save Discount - Free for 2 months",
			"subscriptionProductFeatures": [],
			"externallyManagedPlanId": null,
			"subscriptionRatePlanNumber": "SRP-01820732",
			"isFromExternalCatalog": false,
			"ratePlanCharges": [
				{
					"id": "71a1836bbe69b2f6951b31a1105f0ae4",
					"originalChargeId": "71a1836bbe69b2f6951b31a1105f0ae4",
					"productRatePlanChargeId": "8ad081dd8fd3d9df018fe2ba736f398e",
					"number": "C-01849841",
					"name": "Cancellation Save Discount - Free for 2 months",
					"productRatePlanChargeNumber": "PRPC-00000403",
					"type": "Recurring",
					"model": "DiscountPercentage",
					"originalListPrice": null,
					"uom": null,
					"version": 1,
					"subscriptionChargeDeliverySchedule": null,
					"numberOfDeliveries": null,
					"priceChangeOption": "NoChange",
					"priceIncreasePercentage": null,
					"currency": "GBP",
					"chargeModelConfiguration": null,
					"inputArgumentId": null,
					"includedUnits": null,
					"overagePrice": null,
					"applyDiscountTo": "ONETIMERECURRINGUSAGE",
					"discountLevel": "subscription",
					"discountClass": null,
					"applyToBillingPeriodPartially": false,
					"billingDay": "ChargeTriggerDay",
					"listPriceBase": null,
					"specificListPriceBase": null,
					"billingPeriod": "Month",
					"specificBillingPeriod": null,
					"billingTiming": null,
					"ratingGroup": null,
					"billingPeriodAlignment": "AlignToCharge",
					"quantity": 0.0,
					"prorationOption": null,
					"isStackedDiscount": false,
					"reflectDiscountInNetAmount": false,
					"smoothingModel": null,
					"numberOfPeriods": null,
					"overageCalculationOption": null,
					"overageUnusedUnitsCreditOption": null,
					"unusedUnitsCreditRates": null,
					"usageRecordRatingOption": null,
					"segment": 1,
					"effectiveStartDate": "2026-01-14",
					"effectiveEndDate": "2026-03-14",
					"processedThroughDate": null,
					"chargedThroughDate": null,
					"done": false,
					"triggerDate": null,
					"triggerEvent": "CustomerAcceptance",
					"endDateCondition": "Fixed_Period",
					"upToPeriodsType": "Months",
					"upToPeriods": 2,
					"specificEndDate": null,
					"mrr": 0.0,
					"dmrc": 0.0,
					"tcv": 0.0,
					"dtcv": 0.0,
					"originalOrderDate": "2025-12-18",
					"amendedByOrderOn": null,
					"description": "",
					"HolidayStart__c": null,
					"HolidayEnd__c": null,
					"ForceSync__c": null,
					"salesPrice": null,
					"taxable": null,
					"taxCode": null,
					"taxMode": null,
					"tiers": null,
					"discountApplyDetails": null,
					"pricingSummary": "100%  discount",
					"price": null,
					"discountAmount": null,
					"discountPercentage": 100.0
				}
			]
		},
		{
			"id": "71a1836bbe69b2f6951b31a110cb0aec",
			"lastChangeType": "Remove",
			"productId": "2c92c0f85a6b134e015a7fcc183e756f",
			"productName": "Contributor",
			"productSku": "SKU-00000049",
			"productRatePlanId": "2c92c0f85a6b134e015a7fcd9f0c7855",
			"productRatePlanNumber": "PRP-00000133",
			"ratePlanName": "Monthly Contribution",
			"subscriptionProductFeatures": [],
			"externallyManagedPlanId": null,
			"subscriptionRatePlanNumber": "SRP-01683536",
			"isFromExternalCatalog": false,
			"ratePlanCharges": [
				{
					"id": "71a1836bbe69b2f6951b31a110ce0aee",
					"originalChargeId": "71a143192b596cc18f96ce3eea658103",
					"productRatePlanChargeId": "2c92c0f85a6b1352015a7fcf35ab397c",
					"number": "C-01718767",
					"name": "Contribution",
					"productRatePlanChargeNumber": null,
					"type": "Recurring",
					"model": "FlatFee",
					"originalListPrice": null,
					"uom": null,
					"version": 2,
					"subscriptionChargeDeliverySchedule": null,
					"numberOfDeliveries": null,
					"priceChangeOption": "NoChange",
					"priceIncreasePercentage": null,
					"currency": "GBP",
					"chargeModelConfiguration": null,
					"inputArgumentId": null,
					"includedUnits": null,
					"overagePrice": null,
					"applyDiscountTo": null,
					"discountLevel": null,
					"discountClass": null,
					"applyToBillingPeriodPartially": false,
					"billingDay": "ChargeTriggerDay",
					"listPriceBase": "Per_Billing_Period",
					"specificListPriceBase": null,
					"billingPeriod": "Month",
					"specificBillingPeriod": null,
					"billingTiming": "IN_ADVANCE",
					"ratingGroup": null,
					"billingPeriodAlignment": "AlignToCharge",
					"quantity": 1.0,
					"prorationOption": null,
					"isStackedDiscount": false,
					"reflectDiscountInNetAmount": false,
					"smoothingModel": null,
					"numberOfPeriods": null,
					"overageCalculationOption": null,
					"overageUnusedUnitsCreditOption": null,
					"unusedUnitsCreditRates": null,
					"usageRecordRatingOption": null,
					"segment": 1,
					"effectiveStartDate": "2025-05-14",
					"effectiveEndDate": "2025-05-14",
					"processedThroughDate": "2025-05-14",
					"chargedThroughDate": "2025-05-14",
					"done": true,
					"triggerDate": null,
					"triggerEvent": "CustomerAcceptance",
					"endDateCondition": "Subscription_End",
					"upToPeriodsType": null,
					"upToPeriods": null,
					"specificEndDate": null,
					"mrr": 8.0,
					"dmrc": 0.0,
					"tcv": 0.0,
					"dtcv": -96.0,
					"originalOrderDate": "2025-05-14",
					"amendedByOrderOn": "2025-05-14",
					"description": "",
					"HolidayStart__c": null,
					"HolidayEnd__c": null,
					"ForceSync__c": null,
					"salesPrice": 8.0,
					"taxable": null,
					"taxCode": null,
					"taxMode": null,
					"tiers": null,
					"discountApplyDetails": null,
					"pricingSummary": "GBP8",
					"price": 8.0,
					"discountAmount": null,
					"discountPercentage": null
				}
			]
		},
		{
			"id": "71a1836bbe69b2f6951b31a110d10af1",
			"lastChangeType": "Add",
			"productId": "8ad09fc281de1ce70181de3b23b2363d",
			"productName": "Supporter Plus",
			"productSku": "SKU-00000072",
			"productRatePlanId": "8ad08cbd8586721c01858804e3275376",
			"productRatePlanNumber": "PRP-00000225",
			"ratePlanName": "Supporter Plus V2 - Monthly",
			"subscriptionProductFeatures": [],
			"externallyManagedPlanId": null,
			"subscriptionRatePlanNumber": "SRP-01683539",
			"isFromExternalCatalog": false,
			"ratePlanCharges": [
				{
					"id": "71a1836bbe69b2f6951b31a110d30af5",
					"originalChargeId": "71a19da0c9396cc2ef26ce40f4240db8",
					"productRatePlanChargeId": "8ad09ea0858682bb0185880ac57f4c4c",
					"number": "C-01718771",
					"name": "Contribution",
					"productRatePlanChargeNumber": null,
					"type": "Recurring",
					"model": "FlatFee",
					"originalListPrice": null,
					"uom": null,
					"version": 1,
					"subscriptionChargeDeliverySchedule": null,
					"numberOfDeliveries": null,
					"priceChangeOption": "NoChange",
					"priceIncreasePercentage": null,
					"currency": "GBP",
					"chargeModelConfiguration": null,
					"inputArgumentId": null,
					"includedUnits": null,
					"overagePrice": null,
					"applyDiscountTo": null,
					"discountLevel": null,
					"discountClass": null,
					"applyToBillingPeriodPartially": false,
					"billingDay": "ChargeTriggerDay",
					"listPriceBase": "Per_Billing_Period",
					"specificListPriceBase": null,
					"billingPeriod": "Month",
					"specificBillingPeriod": null,
					"billingTiming": "IN_ADVANCE",
					"ratingGroup": null,
					"billingPeriodAlignment": "AlignToCharge",
					"quantity": 1.0,
					"prorationOption": null,
					"isStackedDiscount": false,
					"reflectDiscountInNetAmount": false,
					"smoothingModel": null,
					"numberOfPeriods": null,
					"overageCalculationOption": null,
					"overageUnusedUnitsCreditOption": null,
					"unusedUnitsCreditRates": null,
					"usageRecordRatingOption": null,
					"segment": 1,
					"effectiveStartDate": "2025-05-14",
					"effectiveEndDate": "2026-05-14",
					"processedThroughDate": "2025-12-14",
					"chargedThroughDate": "2026-01-14",
					"done": false,
					"triggerDate": null,
					"triggerEvent": "CustomerAcceptance",
					"endDateCondition": "Subscription_End",
					"upToPeriodsType": null,
					"upToPeriods": null,
					"specificEndDate": null,
					"mrr": 0.0,
					"dmrc": 0.0,
					"tcv": 0.0,
					"dtcv": 0.0,
					"originalOrderDate": "2025-05-14",
					"amendedByOrderOn": null,
					"description": "",
					"HolidayStart__c": null,
					"HolidayEnd__c": null,
					"ForceSync__c": null,
					"salesPrice": 0.0,
					"taxable": null,
					"taxCode": null,
					"taxMode": null,
					"tiers": null,
					"discountApplyDetails": null,
					"pricingSummary": "GBP0",
					"price": 0.0,
					"discountAmount": null,
					"discountPercentage": null
				},
				{
					"id": "71a1836bbe69b2f6951b31a110d30af3",
					"originalChargeId": "71a19da0c9396cc2ef26ce40f4240db7",
					"productRatePlanChargeId": "8ad08cbd8586721c01858804e3715378",
					"number": "C-01718770",
					"name": "Subscription",
					"productRatePlanChargeNumber": "PRPC-00000361",
					"type": "Recurring",
					"model": "FlatFee",
					"originalListPrice": null,
					"uom": null,
					"version": 1,
					"subscriptionChargeDeliverySchedule": null,
					"numberOfDeliveries": null,
					"priceChangeOption": "NoChange",
					"priceIncreasePercentage": null,
					"currency": "GBP",
					"chargeModelConfiguration": null,
					"inputArgumentId": null,
					"includedUnits": null,
					"overagePrice": null,
					"applyDiscountTo": null,
					"discountLevel": null,
					"discountClass": null,
					"applyToBillingPeriodPartially": false,
					"billingDay": "ChargeTriggerDay",
					"listPriceBase": "Per_Billing_Period",
					"specificListPriceBase": null,
					"billingPeriod": "Month",
					"specificBillingPeriod": null,
					"billingTiming": "IN_ADVANCE",
					"ratingGroup": null,
					"billingPeriodAlignment": "AlignToCharge",
					"quantity": 1.0,
					"prorationOption": null,
					"isStackedDiscount": false,
					"reflectDiscountInNetAmount": false,
					"smoothingModel": null,
					"numberOfPeriods": null,
					"overageCalculationOption": null,
					"overageUnusedUnitsCreditOption": null,
					"unusedUnitsCreditRates": null,
					"usageRecordRatingOption": null,
					"segment": 1,
					"effectiveStartDate": "2025-05-14",
					"effectiveEndDate": "2026-05-14",
					"processedThroughDate": "2025-12-14",
					"chargedThroughDate": "2026-01-14",
					"done": false,
					"triggerDate": null,
					"triggerEvent": "CustomerAcceptance",
					"endDateCondition": "Subscription_End",
					"upToPeriodsType": null,
					"upToPeriods": null,
					"specificEndDate": null,
					"mrr": 12.0,
					"dmrc": 12.0,
					"tcv": 144.0,
					"dtcv": 144.0,
					"originalOrderDate": "2025-05-14",
					"amendedByOrderOn": null,
					"description": "",
					"HolidayStart__c": null,
					"HolidayEnd__c": null,
					"ForceSync__c": null,
					"salesPrice": 12.0,
					"taxable": null,
					"taxCode": null,
					"taxMode": null,
					"tiers": null,
					"discountApplyDetails": null,
					"pricingSummary": "GBP12",
					"price": 12.0,
					"discountAmount": null,
					"discountPercentage": null
				}
			]
		}
	],
	"orderNumber": "O-01116876",
	"externallyManagedBy": null,
	"statusHistory": [
		{
			"startDate": "2025-05-14",
			"endDate": "2026-05-14",
			"status": "Active"
		},
		{
			"startDate": "2026-05-14",
			"endDate": null,
			"status": "OutOfTerm"
		}
	],
	"invoiceGroupNumber": null,
	"createTime": "2025-12-18 13:23:17",
	"updateTime": "2025-12-18 13:23:17",
	"scheduledCancelDate": null,
	"scheduledSuspendDate": null,
	"scheduledResumeDate": null,
	"communicationProfileId": null
}
